# IFCOpeningData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCOpeningData Properties
IFCOpeningData Class See Also
---
The IFCOpeningData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsRecess | Trus if it is a recess, false if it is an opening. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OpeningElementId | The opening element id. |

# See Also
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace